Repository: Freso/resynthesizer
Catalog: po/*.po
Languages: pl

source: You must first select a region to heal.
pl: Musisz najpierw wybrać obszar.

source: _Heal selection...
pl: Łataj zaznaczenie.

source: Context sampling width (pixels):
pl: Szerokość kontekstu próbkowania (w pikselach)

source: Sample from:
pl: Próbka z:

source: All around
pl: Dookoła

source: Sides
pl: Boki

source: Above and below
pl: Powyżej i poniżej

source: Filling order:
pl: Kolejność wypełniania

source: Random
pl: Losowe

source: Inwards towards center
pl: Do środka

source: Outwards from center
pl: Od środka

source: Removes alpha channel by synthesis. Fill outward for edges, inward for holes.
pl: Usuwa kanał alfa za pomocą syntezy. Wypełnij na zewnątrz dla krawędzi, wewnątrz dla dziur.

source: Heal transparency...
pl: Łataj przezroczystość...

source: The style source cannot be of mode INDEXED
pl: Źródło stylu nie może być w trybie INDEXED

source: Transfer style (color and surface) from a chosen source to the active layer.
pl: Przenieś styl (kolor i powierzchnię) z wybranego źródła do aktywnej warstwy.

source: Style...
pl: Styl...

source: Source of style:
pl: Źródło stylu:

source: Percent transfer:
pl: Postęp przenoszenia

source: Map by:
pl: Mapuj według

source: Color and brightness
pl: Kolor i jasność

source: Brightness only
pl: Wyłącznie jasność

source: Create a new image with texture from the current image or selection. Optionally, create image edges suited for further, seamless tiling.
pl: Utwórz nowy obraz z teksturą z bieżącego obrazu lub zaznaczenia. Opcjonalnie utwórz krawędzie obrazu odpowiednie do dalszego, płynnego układania.

source: _Texture...
pl: _Tekstura...

source: Ratio of size of new image to source selection
pl: Stosunek rozmiaru nowego obrazu do źródła zaznaczenia

source: Make new image edges suitable for seamless tiling
pl: Spraw, aby nowe krawędzie obrazu były odpowiednie do płynnego układania

source: Enlarge image and synthesize to sharpen.
pl: Powiększ obraz i syntetyzuj, aby wyostrzyć.

source: Enlarge & sharpen...
pl: Powiększ i wyostrz...

source: Scale by:
pl: Przeskaluj:

source: Seamlessly fill with a pattern using synthesis.
pl: Płynnie wypełnij wzorem za pomocą syntezy.

source: _Fill with pattern seamless...
pl: Płynnie wypełnij wzorem

source: Pattern:
pl: Wzór:

source: Sharpen image by synthesis.
pl: Wyostrz obraz używając syntezy.

source: Sharpen by synthesis...
pl: Wyostrz za pomocą syntezy...

source: Sharpening:
pl: Wyostrzanie:

source: A layer must be active, not a channel.
pl: Aktywna musi być warstwa, a nie kanał.

source: Enlarge image by synthesizing a border that matches the edge, maintaining perspective. Works best for small enlargement of natural edges. Undo a Crop instead, if possible!
pl: Powiększ obraz, syntetyzując obramowanie pasujące do krawędzi, zachowując perspektywę. Najlepiej sprawdza się przy niewielkich powiększeniach naturalnych krawędzi. Zamiast tego cofnij kadrowanie, jeśli to możliwe!

source: Uncrop...
pl: Cofnij kadrowanie

source: Percent enlargement
pl: Powiększenie (w procentach)

source: Make tiles, apply themes, render texture, remove features, etc.
pl: Twórz kafelki, stosuj motywy, renderuj tekstury, usuwaj elementy itp.

source: _Resynthesize...
pl: _Resyntetyzuj...

source: Context:
pl: Kontekst:

source: Random order, without context
pl: Losowa kolejność, bez kontekstu

source: Random order, with context
pl: Kolejność losowa, z kontekstem

source: Randomized bands, concentric, inwards
pl: Randomizowane prążki, koncentryczne, do wewnątrz

source: Randomized bands, horizontally, inwards (i.e. squeezing from top and bottom)
pl: Randomizowane prążki, poziomo, do wewnątrz

source: Randomized bands, vertically, inwards (i.e. squeezing from left and right)
pl: Randomizowane prążki, pionowo, do wewnątrz

source: Randomized bands, concentric, outwards (e.g. for uncrop)
pl: Randomizowane prążki, koncentryczne, skierowane na zewnątrz

source: Randomized bands, horizontally, outwards, (i.e. expanding to top and bottom)
pl: Randomizowane prążki, poziomo, na zewnątrz

source: Randomized bands, vertically, outwards (i.e. expanding to left and right)
pl: Randomizowane prążki, pionowo, na zewnątrz

source: Randomized bands, concentric, inwards and outwards (i.e. squeezing in and out a donut)
pl: Randomizowane prążki, koncentryczne, do wewnątrz i na zewnątrz

source: Resynthesize
pl: _Resyntetyzuj...

source: _Cancel
pl: _Anuluj

source: Options
pl: Opcje

source: Tweaks
pl: Ustawienia

source: Input
pl: Wejście

source: Texture source:
pl: Źródło tekstury:

source: Output
pl: Wyjście

source: Texture transfer
pl: Transfer tekstury

source: Use texture transfer
pl: Użyj transferu tekstury

source: Input map:
pl: Mapa wejścia:

source: Output map:
pl: Mapa wyjścia:

source: Resynthesizer operates by copying pixels, one at a time, from the input to the output. A neighbourhood of nearby pixels in the output are compared with neighbourhoods of pixels in the input. The pixel at the center of the best matching neighbourhood is copied to the output.
pl: Resynthesizer działa poprzez kopiowanie pikseli, pojedynczo, z wejścia na wyjście. Sąsiedztwo pobliskich pikseli na wyjściu jest porównywane z sąsiedztwem pikseli na wejściu. Piksel w środku najlepiej dopasowanego sąsiedztwa jest kopiowany na wyjście.

source: Neighbourhood size:
pl: Rozmiar sąsiedztwa:

source: - How many nearby pixels in the output are to be used?
pl: - Ile pobliskich pikseli na wyjściu ma zostać użytych?

source: Search thoroughness:
pl: Dokładność szukania:

source: - How many locations in the input are examined?
pl: - Ile lokalizacji w wejściu jest sprawdzanych?

source: Sensitivity to outliers:
pl: Wrażliwość na wartości odstające:

source: - To what extent does a very bad match on a single pixel disqualify a location?
pl: - W jakim stopniu bardzo złe dopasowanie pojedynczego piksela dyskwalifikuje lokalizację?

source: Incompatible image mode.
pl: Niekompatybilny tryb obrazu.

source: Resynthesizer failed to get parameters.
pl: Resynthesizer nie znalazł parametrów.

source: The input texture and output image must have the same number of color channels.
pl: Tekstura wejściowa i wyjściowy obraz muszą mieć tyle samo kanałów koloru.

source: The input and output maps must have the same mode
pl: Mapy wejściowe i wyjściowe muszą mieć ten sam tryb

source: The input map should be the same size as the input texture image
pl: Mapa wejściowa powinna mieć taki sam rozmiar jak wejściowy obraz tekstury

source: The output map should be the same size as the output image
pl: Mapa wyjściowa powinna mieć taki sam rozmiar jak obraz wyjściowy

source: synthesizing...
pl: syntetyzowanie...

source: The texture source is empty. Does any selection include non-transparent pixels?
pl: Źródło tekstury jest puste. Czy jakieś zaznaczenie zawiera nieprzezroczyste piksele?

source: The output layer is empty. Does any selection have visible pixels in the active layer?
pl: Warstwa wyjściowa jest pusta. Czy jakiekolwiek zaznaczenie ma widoczne piksele w aktywnej warstwie?
